In [12]:
import pandas as pd
df1 = pd.DataFrame({
    'city':['NY','Chicago','Washington','orlando'],
    'temp':[32,34,40,35]
})
df2 = pd.DataFrame({
    'city':['NY','Chicago','Washington','SF'],
    'humidity':[40,50,60,55]
})

In [13]:
df1

         city  temp
0          NY    32
1     Chicago    34
2  Washington    40
3     orlando    35

In [14]:
df2

         city  humidity
0          NY        40
1     Chicago        50
2  Washington        60
3          SF        55

In [18]:
df3 = pd.merge(df1,df2,on='city',how="inner",indicator=True) #same as inner join in dbms,indicator helps in telling from which set it came for
df3

         city  temp  humidity _merge
0          NY    32        40   both
1     Chicago    34        50   both
2  Washington    40        60   both

In [17]:
df3 = pd.merge(df1,df2,on='city',how="left") #same as left outer join in dbms
df3

         city  temp  humidity
0          NY    32      40.0
1     Chicago    34      50.0
2  Washington    40      60.0
3     orlando    35       NaN

In [21]:
import pandas as pd
df1 = pd.DataFrame({
    'city':['NY','Chicago','Washington','orlando'],
    'temp':[32,34,40,35],
    'humidity':[35,45,65,70]
})
df2 = pd.DataFrame({
    'city':['NY','Chicago','Washington','SF'],
    'humidity':[40,50,60,55],
    'temp':[47,56,22,30]
})

In [25]:
df3 = pd.merge(df1,df2,on='city',suffixes=('_df1','_df2'))
df3

         city  temp_df1  humidity_df1  humidity_df2  temp_df2
0          NY        32            35            40        47
1     Chicago        34            45            50        56
2  Washington        40            65            60        22